OpenFOAM/simpleFsi/simpleFsi-OF3.0.0/cases/validation-helloWorld/system/helloWorld
helloWorld1
{
    type        helloWorld;
    
    functionObjectLibs ( "libhelloWorldFunctionObject.so" );
        
    outputControl   timeStep;
    timeInterval    1;  //must be 1
    
    log         yes;

    //from libforces
    patches     ( cylinder );
    rhoName     rhoInf;      // Indicates incompressible
    rhoInf      1000;        // Redundant for incompressible
    CofR        (0 0 0);     // Reference point for torque computation 
    
}

